package org.itmo.java.homework.homework9;

/*
Создайте Map, в котором для каждого пользователя хранится количенство очков, заработанной в игре (Map<User,Integer>)
Напишите программу, которая считывает с коноли имя и показывает, сколько очков у такого пользователя
Сами данные добавить при создании или сгенерировать случайно

2 Написать метод, который на входе получает коллекцию объектов, а возвращает коллекцию без дубликатов
_для решения этой задачи пригодится Set_

3. Напишите метод. который доабвляет 1млн элементов в ArrayList и LnkedList
напишите метод, который наугда забирает из заполненного списка элементы наугад 100000 раз.
Замерьте время, сравните, предположите почему

4.Опишите класс User с одним полем Name. Добавьте конструктор, геттер, сеттер
*/

public class Main {
    public static void main(String[] args) {

    }
}
