package org.itmo.java.homework.homework7;

/*
1.	Создайте класс Самолет. В классе создайте вложенный класс крыло. Внутри класса Крыло реализуйте:
●	поле для хранения информации про вес крыла;
●	метод, что будет показывать вес крыла.

2.	Выполните предыдущее задание. В главном классе создайте объект и добавьте во вложенный класс данные про вес крыла, а также выведите информацию на экран. Создайте два объекта и добавьте разный вес для крыльев.

*/

public class Main {
    public static void main(String[] args) {

    }
}
