package org.itmo.java.homework.homework5;

/*
1.	Написать метод для поиска самого длинного слова в тексте.

2.	Написать метод, который проверяет является ли слово палиндромом.

3.	Напишите метод, заменяющий в тексте все вхождения слова «бяка» на «[вырезано цензурой]».

4.	Имеются две строки. Найти количество вхождений одной (являющейся подстрокой) в другую.

5.	Напишите метод, который инвертирует слова в строке. Предполагается, что в строке нет знаков препинания, и слова разделены пробелами.
Sample Output:
The given string is: This is a test string
The string reversed word by word is:
sihT si a tset gnirts

https://docs.oracle.com/javase/8/docs/api/java/lang/String.html

'\n' - символ новой строки;
'\t' - символ табуляции;
'\r' - символ возврата каретки;
'\\' - это сам символ обратной косой черты;
'\''- это одинарная кавычка;
'\"' - это двойная кавычка.
__________________________________________________

  %d - int, short, byte, long
  %c - char
  %f - double, float
  %s - String



*/

public class Main {
    public static void main(String[] args) {

    }
}
